// 角色数据
window.characterData = {
    "角色任选!": {
        "头像": "https://tse4-mm.cn.bing.net/th/id/OIP-C.JyPv5GjyP7I8leDiGxu2hgAAAA?cb=iwc2&rs=1&pid=ImgDetMain",
    },
    "爱可菲": {
        "头像": "https://act-upload.mihoyo.com/ys-obc/2025/04/30/73740358/cc1d0ae2568f3791339a21ff22b43ed9_5999783633252671899.png",
        "元素类型": "冰",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "伊法": {
        "头像": "https://act-upload.mihoyo.com/ys-obc/2025/04/30/73740358/2e3d4c0271c4a08f524c767ba0166c18_589065208203616822.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "四星"
    },
    "瓦雷莎": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2025/03/20/50494840/b929945af5d8b2fdeabfa1fb96e5b082_700551622398662804.png",
        "元素类型": "雷",
        "武器类型": "法器",
        "星级": "五星"
    },
    "伊安珊": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2025/03/20/50494840/19d45814816f79b54e2dd3fb5e212615_7586309228486916731.png",
        "元素类型": "雷",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "梦见月瑞希": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2025/02/10/50494840/d6aa6797e523529d661616e268e74380_389705375310379015.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "五星"
    },
    "蓝砚": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/12/25/4328207/3f06ace813ea5d401cce5088257212ee_1796029922647873700.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "四星"
    },
    "玛薇卡": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/12/25/4328207/dc36c2dc0fc1bcd418a17fe907e7bb33_5872605765675589334.png",
        "元素类型": "火",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "茜特菈莉": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/12/25/4328207/37aa13adb9419746ac29fe13893f2d91_3053993473631843068.png",
        "元素类型": "冰",
        "武器类型": "法器",
        "星级": "五星"
    },
    "恰斯卡": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/11/15/4328207/58706184319196823f524fb123660410_363771165283840438.png",
        "元素类型": "风",
        "武器类型": "弓",
        "星级": "五星"
    },
    "欧洛伦": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/11/15/6276411/83cabdbf42c9f395ecc6bbe370b6cc86_2387313554830714373.png",
        "元素类型": "雷",
        "武器类型": "弓",
        "星级": "四星"
    },
    "希诺宁": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/10/04/4328207/ff1745c76b33c041c26e64e137dae368_8553993354333645956.png",
        "元素类型": "岩",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "基尼奇": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/09/08/4328207/829ceb3bdc9e5c7f91d03c52c111a11c_4825365709203515402.png",
        "元素类型": "草",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "玛拉妮": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/08/23/4328207/b2a2cf3412e9399a0a519525b330689e_2457703043196193750.png",
        "元素类型": "水",
        "武器类型": "法器",
        "星级": "五星"
    },
    "卡齐娜": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/08/23/4328207/915caed11374ed6c80912d334d3acee3_3325609054012637151.png",
        "元素类型": "岩",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "艾梅莉埃": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/08/28/195563531/3753712ae6c479c8f1ee841f60b1835f_7919993437788900063.png",
        "元素类型": "草",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "希格雯": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/07/16/195563531/b517758b373bfdc2afa3a93e0f68381f_4356070929918876023.png",
        "元素类型": "水",
        "武器类型": "弓",
        "星级": "五星"
    },
    "赛索斯": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/06/25/195563531/94b2aad4aa86087da3427cfd13223406_1838144106966207925.png",
        "元素类型": "雷",
        "武器类型": "弓",
        "星级": "四星"
    },
    "克洛琳德": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/06/25/195563531/8640359c4557760b17135f70f348bece_9108632157062235155.png",
        "元素类型": "雷",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "阿蕾奇诺": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/04/24/4328207/233036f362e6ac0dfdd297eafa96469a_1487053469241930464.png",
        "元素类型": "火",
        "武器类型": "长枪",
        "星级": "五星"
    },    
    "千织": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/03/08/4328207/b7981ed652471fb61c8c076ddeb80c35_6675240404947958375.png",
        "元素类型": "岩",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "闲云": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/01/25/4328207/ead14be79052a8d19bbbb2a69c2f0c23_2532694057563153983.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "五星"
    },
    "嘉明": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/01/27/4328207/2b04443b4a98a07ab7e933399fbd2e6e_8078545953039492000.png",
        "元素类型": "火",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "夏沃蕾": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/01/04/4328207/e77bf4b2d49e3cc50545b83dc071d3a6_7850725164094643458.png",
        "元素类型": "火",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "娜维娅": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/08/06/6276411/088e445c37004d5bae3f392460ec9133_5211661620543947822.png",
        "元素类型": "岩",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "芙宁娜": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/07/16/195563531/376ed8406d6315d5a77f4cdd5e917b9b_7215590901861641475.png",
        "元素类型": "水",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "夏洛蒂": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2023/11/04/4328207/36006d0ad619b747c9df0f40dfd01c10_7459161693395273701.png",
        "元素类型": "冰",
        "武器类型": "法器",
        "星级": "四星"
    },
    "莱欧斯利": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2023/10/17/4328207/e1f49352e0f53081cf6d7758cc9a8eef_77085490975887896.png",
        "元素类型": "冰",
        "武器类型": "法器",
        "星级": "五星"
    },
    "那维莱特": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2023/09/22/4328207/df52fcefd995f94e041d9baec6ae891d_7203866992337938184.png",
        "元素类型": "水",
        "武器类型": "法器",
        "星级": "五星"
    },
    "菲米尼": {
        "头像": "https://act-upload.mihoyo.com/ys-obc/2023/08/25/183046623/89f7db6b71496415c3ddab8d5d2c049c_963653190890281567.png",
        "元素类型": "冰",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "林尼": {
        "头像": "https://act-upload.mihoyo.com/ys-obc/2023/08/17/24077343/04309f44cfd43ecaad1c6b17504e842b_4501929243289411018.png",
        "元素类型": "火",
        "武器类型": "弓",
        "星级": "五星"
    },
    "琳妮特": {
        "头像": "https://act-upload.mihoyo.com/ys-obc/2023/08/17/24077343/74feea88c304c86a33be3fd191d055dc_2469184593388252358.png",
        "元素类型": "风",
        "武器类型": "单手剑",
        "星级": "四星"
    },
    "绮良良": {
        "头像": "https://act-upload.mihoyo.com/ys-obc/2023/05/22/4328207/3d3c77af378ae13a284da6ee46e7c8a5_6115762659247939353.png",
        "元素类型": "草",
        "武器类型": "单手剑",
        "星级": "四星"
    },
    "白术": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/06/05/195563531/582333e1eede03ef5083c8fdf83f836f_5616908562056844182.png",
        "元素类型": "草",
        "武器类型": "法器",
        "星级": "五星"
    },
    "卡维": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2023/04/11/4328207/27f90730a0c5c4d6ff4d29ebfb1c5d60_7616208328714055928.png",
        "元素类型": "草",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "米卡": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2023/03/18/4328207/37fed1b2ed047eeea78833328ffb27e4_8054575673536318186.png",
        "元素类型": "冰",
        "武器类型": "弓",
        "星级": "四星"
    },
    "迪希雅": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2023/03/21/195563531/3499be9a309249e2ddf1a0533af1f4c7_958475410876966785.png",
        "元素类型": "火",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "艾尔海森": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/06/25/195563531/c1c6746b3d53c687c3f570337dbecb32_1172740701584748808.png",
        "元素类型": "草",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "瑶瑶": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2023/01/17/4328207/6616c1963d8b8cd12303e683872778d6_5414525268363973241.png",
        "元素类型": "草",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "流浪者": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/06/05/195563531/fb1713aa667884c5552452170b5931fa_4501254112268017431.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "五星"
    },
    "珐露珊": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/12/06/4328207/38a192da1174b705cc6648e854162ab0_6403431489397028121.png",
        "元素类型": "风",
        "武器类型": "弓",
        "星级": "四星"
    },
    "莱依拉": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/10/24/4328207/f7f5c758e157cc6d6ca7b7a378d665e6_8346107013175588314.png",
        "元素类型": "冰",
        "武器类型": "法器",
        "星级": "四星"
    },
    "纳西妲": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/10/24/4328207/f9f8f331dea3cc4920037df2018437d0_4958876478140111847.png",
        "元素类型": "草",
        "武器类型": "法器",
        "星级": "五星"
    },
    "妮露": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/08/06/6276411/aad25ff85d04d98abbac7b1cc405ea69_4186120229500438642.png",
        "元素类型": "水",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "赛诺": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/09/20/4328207/b3847d2416145eb8bb6343302e2b4dca_6997837798254516316.png",
        "元素类型": "雷",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "坎蒂丝": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/09/20/4328207/0587df6ac5144c9dd023b0f73ceaf8be_7837788427682725710.png",
        "元素类型": "水",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "多莉": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/09/07/195563531/844969ce9b8bc5ebf9d1be69d7b6d7b2_4659886404719657655.png",
        "元素类型": "雷",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "提纳里": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/08/23/75379475/6953568084aaa02bc7a774430f1f3b56_9172357402103659910.png",
        "元素类型": "草",
        "武器类型": "弓",
        "星级": "五星"
    },
    "柯莱": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/08/23/75379475/a0150a8489abc5011a44b4f6419ccec7_2812696932246907984.png",
        "元素类型": "草",
        "武器类型": "弓",
        "星级": "四星"
    },
    "鹿野院平藏": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/07/09/4328207/cc145e6cd2f0dacb39ce36f7ebf257fc_7138351098291917226.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "四星"
    },
    "久岐忍": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/05/10/4328207/33c41932d1b5531ac73bca243c761816_9206912725698153960.png",
        "元素类型": "雷",
        "武器类型": "单手剑",
        "星级": "四星"
    },
    "夜兰": {
        "头像": "https://act-upload.mihoyo.com/wiki-user-upload/2024/08/28/195563531/79396e8f1225b66e201036e086dd2d8a_1123934130505570131.png",
        "元素类型": "水",
        "武器类型": "弓",
        "星级": "五星"
    },
    "神里绫人": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/03/25/4328207/d16fbf95d62771daa65ab5d04f6abbd5_8453888407594383379.png",
        "元素类型": "水",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "八重神子": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/02/15/6276411/2a54cd4008e8bc398f3f8bdc08225048_2883595654384922672.jpg",
        "元素类型": "雷",
        "武器类型": "法器",
        "星级": "五星"
    },
    "申鹤": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/01/05/16314655/e2dfeee83654c0a6a7436b7c120c105a_6628180966971160404.png",
        "元素类型": "冰",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "云堇": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/01/05/16314655/6f4bbe7d060f72a0c84e868887ac7a32_4711867403945994990.png",
        "元素类型": "岩",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "荒泷一斗": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/12/14/16314655/567d0cf114a7f799d650df6e4c7cc0e2_8422200515118882596.jpg",
        "元素类型": "岩",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "五郎": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/12/14/16314655/1535aaa6189d4262445c0a66ead22eb9_8396030312270652951.png",
        "元素类型": "岩",
        "武器类型": "弓",
        "星级": "四星"
    },
    "托马": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/11/02/16314655/f4b404cae89b96327a5b87500f7833c9_6577116317420146203.png",
        "元素类型": "火",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "珊瑚宫心海": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/09/21/75379475/5f6f5d0c81155aea5c939ba08249e5d5_6649173224604660824.png",
        "元素类型": "水",
        "武器类型": "法器",
        "星级": "五星"
    },
    "雷电将军": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/09/01/16314655/4f2125e44d2b9e15611877eda1794ec7_7083452076426995696.png",
        "元素类型": "雷",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "九条裟罗": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/09/01/16314655/5284b4f47bf6d9e9451d79ad5066d744_9148992125502860596.png",
        "元素类型": "雷",
        "武器类型": "弓",
        "星级": "四星"
    },
    "埃洛伊": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/11/05/10875381/65886603cf7f0bdbaa82a165898237a3_1473519897376013260.png",
        "元素类型": "冰",
        "武器类型": "弓",
        "星级": "五星"
    },
    "宵宫": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/10/75276545/43014af35ae9c4cdf19a8323aa04a0a9_2108182380466335233.png",
        "元素类型": "火",
        "武器类型": "弓",
        "星级": "五星"
    },
    "早柚": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/10/75276545/4f50355892c08017346ea3ab80071b9c_1725343112540399387.png",
        "元素类型": "风",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "神里绫华": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/07/21/75276545/eaef31b81b190dc676413b099c540526_6543346382757797116.png",
        "元素类型": "冰",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "枫原万叶": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/2566b97ea262980d9bcd7db6a116bfd4_6795571745044574054.png",
        "元素类型": "风",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "优菈": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/525f808e85fb7a13c37debaf3c7d1463_4010662131576296773.png",
        "元素类型": "冰",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "烟绯": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/b8952d8a5d2d266126ce370c4eb78438_4209492093986588378.png",
        "元素类型": "火",
        "武器类型": "法器",
        "星级": "四星"
    },
    "罗莎莉亚": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/02/16/6276411/bdec34acae15315368017c1dbc29e106_1767613545250694082.png",
        "元素类型": "冰",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "胡桃": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/8980427ee3cecce2a46400d2c0af6d20_4290442929626456243.png",
        "元素类型": "火",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "魈": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/a02533e3ac055344982bcfd04865ae72_6103227973780149519.png",
        "元素类型": "风",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "甘雨": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/8b9946e573bf7aff9801c580707a23e1_3026364173026253689.png",
        "元素类型": "冰",
        "武器类型": "弓",
        "星级": "五星"
    },
    "阿贝多": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/01009cc20f9a4ebf4ece5e96fdecad1a_3067405046796818316.png",
        "元素类型": "岩",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "辛焱": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/a4b09e58a0d52ea0808b4cef5725ac93_6743022430414510479.png",
        "元素类型": "火",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "钟离": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/6682780141a9e7788da99c71b1cfd5c3_6751062493374563471.png",
        "元素类型": "岩",
        "武器类型": "长枪",
        "星级": "五星"
    },
    "迪奥娜": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/759f0ebba20d33f606c2ecc025b9b586_6011368354846344391.png",
        "元素类型": "冰",
        "武器类型": "弓",
        "星级": "四星"
    },
    "达达利亚": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/c0a4fcefc01b018856439e023dd4dc7a_6675006735371357498.png",
        "元素类型": "水",
        "武器类型": "弓",
        "星级": "五星"
    },
    "安柏": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/02/16/6276411/138132721f21bf60c53a8935a8fb0107_8908120754759624960.png",
        "元素类型": "火",
        "武器类型": "弓",
        "星级": "四星"
    },
    "凯亚": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/60d8b985eef1e6e0e959410893a75dc0_6659933186171988912.png",
        "元素类型": "冰",
        "武器类型": "单手剑",
        "星级": "四星"
    },
    "丽莎": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/014d59ec5b78c3499b90f45fc80c00a4_5392359609224242061.png",
        "元素类型": "雷",
        "武器类型": "法器",
        "星级": "四星"
    },
    "芭芭拉": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/7f1ac500bafa0526438e4e5b95165991_9116453886373904076.png",
        "元素类型": "水",
        "武器类型": "法器",
        "星级": "四星"
    },
    "雷泽": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/24edfa5586de73329a2b2c5c5d4262a3_3505783202009716970.png",
        "元素类型": "雷",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "香菱": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/83a69074378a0837ca65d33e9052d729_6648871595979928785.png",
        "元素类型": "火",
        "武器类型": "长枪",
        "星级": "四星"
    },
    "北斗": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/0f7406a1ea1b7fb827d7abe14bfe83e8_3108123811393147392.png",
        "元素类型": "雷",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "行秋": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/cd48b60376438c60dbaaa8a85e6a480b_2048377578381627282.png",
        "元素类型": "水",
        "武器类型": "单手剑",
        "星级": "四星"
    },
    "凝光": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/e4e41cdfac3bdc225f0b847f2cc2cd72_5640782607282153058.png",
        "元素类型": "岩",
        "武器类型": "法器",
        "星级": "四星"
    },
    "菲谢尔": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/18a67c8802d7184db1449693908fe6cf_7858478886557060389.png",
        "元素类型": "雷",
        "武器类型": "弓",
        "星级": "四星"
    },
    "班尼特": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/498b43ef0d21c4e2c1d7a1dea0deea3f_2145838239611168396.png",
        "元素类型": "火",
        "武器类型": "单手剑",
        "星级": "四星"
    },
    "诺艾尔": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/5cd5b91e504b2466197796cb26fcb7be_508847912159113655.png",
        "元素类型": "岩",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "重云": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/0bd80f58871b97281be47fcd6e2d7487_1302151446666002486.png",
        "元素类型": "冰",
        "武器类型": "大剑",
        "星级": "四星"
    },
    "砂糖": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/b30efaf1e19725ddda490a2028b17464_6998283335917930867.png",
        "元素类型": "风",
        "武器类型": "法器",
        "星级": "四星"
    },
    "琴": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/02/16/6276411/a7608c6a588467440f7685a22ab6547c_3946325001679449884.png",
        "元素类型": "风",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "迪卢克": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/8ae58465155b31a21319522383027436_4999468226785017726.png",
        "元素类型": "火",
        "武器类型": "大剑",
        "星级": "五星"
    },
    "七七": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/a08d22cf34d2836519a80a8537fe12c8_7861266877849414180.png",
        "元素类型": "冰",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "莫娜": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/02/16/6276411/d7d8e4a15f70e31a16edaa6d7389437f_2242463119371173498.png",
        "元素类型": "水",
        "武器类型": "法器",
        "星级": "五星"
    },
    "刻晴": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/666155bbd60391341253e4b1daace9d4_2687379046030308520.png",
        "元素类型": "雷",
        "武器类型": "单手剑",
        "星级": "五星"
    },
    "可莉": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/06/21/283462834/d2972c634d9d81979774b22b49d1ab01_887661176891008491.png",
        "元素类型": "火",
        "武器类型": "法器",
        "星级": "五星"
    },
    "温迪": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2021/08/23/75276545/3008da32b80ba05f243bc2c858b534b5_540461000064419548.png",
        "元素类型": "风",
        "武器类型": "弓",
        "星级": "五星"
    },
    "旅行者": {
        "头像": "https://uploadstatic.mihoyo.com/ys-obc/2022/05/24/4328207/cb560b65a2880d2fa03d1d25faa50805_8382943334706958229.png",
        "武器类型": "单手剑",
        "星级": "五星"
    },
};
