// 事件
const hardmission = {
    "凑不出啊...": {
        "内容": "每位玩家的圣遗物不可以组成四件套",
    },
    "喝水杯": {
        "内容": "每位玩家都不可以携带空之杯",
    },
    "轮到谁休息啦？": {
        "内容": "每场战斗都只能有三位玩家参加",
    },
    "禁止增益": {
        "内容": "每位玩家都不可以吃获得增益buff的食物或药剂",
    },
    "这个真的能用吗？": {
        "内容": "所有人不可以使用70级或以上等级的武器",
    },
    "一并超": {
        "内容": "接下来的战斗中不可以回血或开盾，死掉后成为观众",
    },
    "不许跑": {
        "内容": "所有人不许冲刺",
    },
    "嘘": {
        "内容": "所有人禁止发言，只能用表情交流",
    },
    "吵死了": {
        "内容": "所有人都要学角色说话，包括攻击音效",
    },
    "重击": {
        "内容": "所有人都只能使用重击",
    },
    "整整齐齐": {
        "内容": "10秒内同时击败点位里所有敌人，失败后所有人圣遗物-1",
    },
    "我发个朋友圈": {
        "内容": "战斗前先近距离和战斗状态的精英怪合照，四个人都要入镜",
    },
    "谁才是大王？": {
        "内容": "四个人使用骰子帽，点数最大的可以命令剩下的三位队友（每人两次投骰子机会）",
    },
    "顺手的事": {
        "内容": "一起搜刮地主的材料，如果让地主拿到材料，地主可以命令其他的三位队友",
    },
    "蹦床": {
        "内容": "队伍中额外新增一位闲云，除闲云外所有人只能使用下落攻击造成伤害",
    },
    "风吹起了从前": {
        "内容": "使用凯亚，丽莎，安柏，旅行者完成战斗",
    },
    "勇敢者的奖励": {
        "内容": "角色任选，无视任何事件",
    },
    "不喜欢金色": {
        "内容": "所有人都只能使用四星圣遗物",
    },
    "神明团建": {
        "内容": "无视bp，所有人选择不同的神明，但只能使用元素战绩",
    },
    "我以为是减速带": {
        "内容": "所有人只能使用火神的机车冲刺造成伤害，没有火神变为观众",
    },
    "国际会面": {
        "内容": "当四人角色所属不同国家时,获得一次消除负面效果。"
    },
    "谁？": {
        "内容": "找到AA才可以继续战斗，提示：他是一名BB地区的CC",
    },
    "禁止传送": {
        "内容": "还差十万八千里",
    },
    "无伤挑战": {
        "内容": "任何人受到伤害都要重新开始战斗（不可以开盾）",
    },
};
