// 事件
const mission = {
    //牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢牢
            "禁A": {
                "内容": "禁止普通攻击重击和下落攻击",
            },
            "禁E": {
                "内容": "禁止使用元素战技",
            },
            "禁Q": {
                "内容": "禁止使用元素爆发",
            },
            "随机": {
                "内容": "放烟花，随机禁「12A,34E,56QJ技能。"
            },
            "禁冲刺": {
                "内容": "你们跑慢点",
            },
            "禁止吃药": {
                "内容": "不可以偷吃喔",
            }, 
            "龙王呢？": {
                "内容": "所有人不能使用元素战技或元素爆发",
            },    
        //武器圣遗物限制
            "我武器呢？": {
                "内容": "只能使用四星武器",
            },
            "我武器呢!??": {
                "内容": "只能使用三星武器",
            },
            "等等..我东西丢了...": {
                "内容": "脱下两件圣遗物",
            },
            "送死流？": {
                "内容": "失去所有圣遗物，每次在战斗中阵亡可以装备一件",
            }, 
            "下理之冠": {
                "内容": "欲戴皇冠，必承其重，但是你的强来了"
            },
            "落井下石": {
                "内容": "成为观众，其余人禁用五星武器",
            },             
        //战斗人数
            "单通": {
                "内容": "谢谢大佬",
            },    
            "成为观众": {
                "内容": "你不许玩原神",
            },
        //其他
            "好吃爱吃": {
                "内容": "时刻保持吃饱饱状态！记得多吃水果",
            },
            "倒反天罡": {
                "内容": "点位怪全体都反打。"
            },
            "青春啊！": {
                "内容": "武器沙漏副词条需为充能且有大必须开,不论在赶路还是战斗。"
            }, 
            "孩子们快跑我中迟滞之水了": {
                "内容": "每个点位有几只怪,你就只能使用几次元素战技"
            },  
            "孩子们快跑我能量给抽了": {
                "内容": "每个点位有几只怪,你就只能使用几次元素爆发"
            },
            "为人民服务": {
                "内容": "其他人的负面buff都由你来承担"
            },            
      
    //爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽爽
            //自选类
                "自选常驻": {
                    "内容": "常驻角色可以随便选",
                },
                "四星自选": {
                    "内容": "偶像酱，比起五星角色，我更喜欢四星角色。",
                },   
                "五星自选": {
                    "内容": " 五星自选！",
                },
                "角色体验卡": {
                    "内容": "可以任意使用一名角色一分钟，不可暂停",       
                },
                "元素王": {
                    "内容": "可以选择一个同种元素类型的四星角色",
                },
                "武器王": {
                    "内容": "可以选择一个同种武器类型的四星角色",
                },
                "自由之风": {
                    "内容": "可选择自选一个蒙德角色，放气球绿/橙自选四星/五星"
                },  
                "岩与契约": {
                    "内容": "可选择自选一个璃月角色，放气球绿/橙自选四星/五星"
                },      
                "雷与永恒": {
                    "内容": "可选择自选一个稻妻角色，放气球绿/橙自选四星/五星"
                },
                "草与轮回": {
                    "内容": "可选择自选一个须弥角色，放气球绿/橙自选四星/五星"
                },
                "水与公正": {
                    "内容": "可选择自选一个枫丹角色，放气球绿/橙自选四星/五星"
                },
                "我们那边啊..": {
                    "内容": "可以选择一位与当前角色国家相同的角色",
                },
                "我来保护你们": {
                    "内容": "可以选择一位提供护盾或治疗的角色，不可造成伤害",
                },
                "萝莉拯救世界": {
                    "内容": "自选更换为一只萝莉,禁止不敬仙师。"
                },
                "夹带私货": {
                    "内容": "你的角色由上家决定，不限制星级。不能讨论直接说，如果没有就作废",
                },                 
            //条件类
                "那万一呢？": {
                    "内容": "用随机帽抽点数，抽到20点可以使用任意角色，可放弃",
                },
                "运气游戏": {
                    "内容": "捡到四星圣遗物可以立马获得一次自选四星角色机会，持续3个回合",
                },
                "灾难始终慢我一步": {
                    "内容": "无伤完成两场战斗，可以自选一位四星角色",
                },
                "元素论": {
                    "内容": "队伍中触发20次元素反应可以自选一位四星角色",
                },
                "高级元素论": {
                    "内容": "队伍中触发50次元素反应可以自选一位五星角色",
                },
                "小手不是很干净": {
                    "内容": "沿路收集5个材料，收集完可以自选一位四星角色",
                },
                "恭迎火神": {
                    "内容": "纳塔角色≥3时，可选择更换火神"
                },
                "英雄开会": {
                    "内容": "当四个角色全是纳塔部落英雄时，全体获得五星自选。"
                },
                "团结的力量": {
                    "内容": "四个帽子相加大于70,你获得一名五星角色自选。"
                },
                "衣角微脏": {
                    "内容": "挑战在深邃摹结株的战斗中坚持两分钟无伤，成功后获得一位四星自选角色",
                },
                "相亲相爱": {
                    "内容": "当前角色之间存在亲/友情关系时，获得一次重抽角色机会。"
                },
                "坚不可摧": {
                    "内容": "角色之间有友情向关系时，若你拿到第一只怪首杀，获得四星三分钟体验卡。"
                },
                "别小瞧我": {
                    "内容": "可选用当前角色单挑任意世界boss，一条命挑战成功后可以任选一位角色",
                },
                "总比没有好吧": {
                    "内容": "可以任选角色，但是只能使用大招",
                },
                "内定奶": {
                    "内容": "若全体没奶存在，需更换为同元本身具有治疗能力角色",
                },                 
            //其他
                "克隆": {
                    "内容": "可以任选一位队伍里相同的角色",
                },
                "交换": {
                    "内容": "可以任选一位玩家交换角色",
                },
                "方位车？给我干哪来了？": {
                    "内容": "依照[AABB]进行替换,角色任选可无视",   //属性和方位会自动随机替换
                },                
        //事件更换
            "重置点数+1": {
                "内容": "可以重置一次任意一个人的角色或事件，可保留",
            },    
            "赦免": {
                "内容": "获得一次取消所有人事件的机会，不可保留",
            },   
            "光宗耀祖还是遗臭万年？": {
                "内容": "必须重抽除自己以外的两个人的事件",
            }, 
            "你笑什么？": {
                "内容": "可以和一个队友分享你的事件，可保留",
            },
            "给我用用": {
                "内容": "放气球绿/橙获得上/家的buff，存在冲突重抽",
            }, 
            "造福大众": {
                "内容": "自己可选择替换为同元五星，其余人可选择是否重抽事件",
            }, 
        //其他        
            "火力全开": {
                "内容": "至少磕两个增伤药"
            },
            "我是老大": {
                "内容": "指定一个人角色和事件",
            },
            "我才是老大！": {
                "内容": "指定所有人角色和事件，且不能被取消",
            },
            "时间旅行者": {
                "内容": "可以选择一个自己之前用过的角色或事件，可保留",
            },
            "任人摆布": {
                "内容": "你的效果由其余三人协商决定。「仅生效于本轮」"
            },
            "拿来吧你": {
                "内容": "可以抢走任何一个玩家的角色或事件，不可保留",
            }, 

    //玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法玩法
        "小嘴巴": {
            "内容": "禁止发言，只能发表情",
        },
        "交换双手": {
            "内容": "谁把我键位改了？",
        },
        "关闭队友特效": {
            "内容": "怎么会这样",
        },
        "关闭UI": {
            "内容": "沉浸式",
        },
        "谁把灯关了？": {
            "内容": "把亮度调到可以接受的最低",  
        },
        "打起来打起来": {
            "内容": "迫使一位队友和你决斗，输掉的人接受任意惩罚，决斗内容为先收集到第一个材料的人获胜",
        },
        "主人的任务": {
            "内容": "放气球，橙上/绿下家成为xx,本轮内完成xx布下的任务。"
        },
        "喵喵计数器": {
            "内容": "每打完一只怪，需要在公屏“喵”一声"
        },
        "全部启动启动启动....": {
            "内容": "所有人都要把三个食物buff吃满，谁先掉buff会被惩罚单通",
        },
        "不要笑挑战": {
            "内容": "笑了就会被惩罚单通",
        },
        "传送完等等我啊": {
            "内容": "必须第一个到达点位并且造成伤害，如果失败变成单通",
        },
        "单手操作": {
            "内容": "别急各位....",
        },
        "镜头锁定": {
            "内容": "不是，我走哪啦？",
        },    
        "漂亮的冻结！": {
            "内容": "不可参与战斗，但是要承担解说的角色，打字或开麦解说当前战斗画面",
        },
        "恭听太阳的轰鸣！！！": {
            "内容": "使用元素战技或元素爆发要大声念出名称",
        },
        "三二一，木头人！": {
            "内容": "主持三二一，木头人游戏，获胜可以命令三位队友，但如果输掉就惨了..",
        },
};
