// 事件
const npc = {
    /*蒙德*/
    "康纳": {
        "国家": "蒙德",
        "职业": "酿酒师",
    },
    "法拉": {
        "国家": "蒙德",
        "职业": "水果商贩",
    },
    "哈里斯": {
        "国家": "蒙德",
        "职业": "厨师",
    },
    "石榴": {
        "国家": "蒙德",
        "职业": "珠宝商人",
    },
    "恩内斯特": {
        "国家": "蒙德",
        "职业": "仓库管理员",
    },
    /*璃月*/
    "狗三儿": {
        "国家": "璃月",
        "职业": "仓库管理员",
    },
    "毓华": {
        "国家": "璃月",
        "职业": "客栈女侍",
    },
    "汐零": {
        "国家": "璃月",
        "职业": "水手",
    },
    "清昼": {
        "国家": "璃月",
        "职业": "诗人",
    },
    "七郎": {
        "国家": "璃月",
        "职业": "采药人",
    },
    /*稻妻*/
    "清子": {
        "国家": "稻妻",
        "职业": "商人",
    },
    "若紫": {
        "国家": "稻妻",
        "职业": "设计师",
    },
    "小畑": {
        "国家": "稻妻",
        "职业": "渔夫",
    },
    "珊瑚": {
        "国家": "稻妻",
        "职业": "侦探",
    },
    "宫崎三朗": {
        "国家": "稻妻",
        "职业": "刀匠",
    },
    /*须弥*/
    "康清涟": {
        "国家": "须弥",
        "职业": "商贩",
    },
    "扎凯": {
        "国家": "须弥",
        "职业": "渔民",
    },
    "卡塔扬": {
        "国家": "须弥",
        "职业": "图书管理员",
    },
    "哈立德": {
        "国家": "须弥",
        "职业": "珠宝商人",
    },
    "巴巴尔": {
        "国家": "须弥",
        "职业": "香料商人",
    },
    /*枫丹*/
    "安特曼": {
        "国家": "枫丹",
        "职业": "鱼贩",
    },
    "肖诺": {
        "国家": "枫丹",
        "职业": "记者",
    },
    "卡嘉妮": {
        "国家": "枫丹",
        "职业": "店员",
    },
    "艾琪诺": {
        "国家": "枫丹",
        "职业": "潜水员",
    },
    "欧仁妮": {
        "国家": "枫丹",
        "职业": "蔬果贩",
    },
    /*纳塔*/
    "恩琳": {
        "国家": "纳塔",
        "职业": "医生",
    },
    "卡胡鲁": {
        "国家": "纳塔",
        "职业": "大祭司",
    },
    "乌米": {
        "国家": "纳塔",
        "职业": "救生员",
    },
};

// 将npc对象绑定到window，使其可以在全局访问
window.npc = npc;